[
  {
    "nombre": "HTML",
    "descripcion": "Nivel básico-intermedio. Capacidad para crear estructuras web semánticas, trabajar con formularios, tablas, listas y elementos multimedia, aplicando buenas prácticas en la organización del contenido.",
    "categoria": "Frontend"
  },
  {
    "nombre": "CSS",
    "descripcion": "Nivel básico-intermedio. Capacidad para aplicar estilos a elementos HTML, utilizar selectores, trabajar con modelos de caja, layouts con Flexbox y Grid, y personalizar interfaces con variables y pseudoclases.",
    "categoria": "Frontend"
  },
  {
    "nombre": "Javascript",
    "descripcion": "JavaScript: Nivel básico-intermedio. Capacidad para manejar eventos, trabajar con funciones, condicionales, ciclos y conceptos fundamentales como arrays, objetos y asincronía con fetch y promesas.",
    "categoria": "Lenguajes"
  },
  {
    "nombre": "React",
    "descripcion": "Nivel intermedio. Experiencia en la creación de componentes funcionales, manejo de estado con hooks (useState, useEffect, useContext, custom hooks, etc), gestión de rutas con React Router y uso de patrones como useReducer y Redux para el manejo global del estado.",
    "categoria": "Frontend"
  },
  {
    "nombre": "Android Studio",
    "descripcion": "Nivel básico-intermedio. Capacidad para desarrollar aplicaciones móviles con layouts XML, manejo de actividades, navegación entre pantallas y conexión con APIs REST usando Kotlin",
    "categoria": "Herramientas"
  },
  {
    "nombre": "NodeJS",
    "descripcion": "Nivel básico-intermedio. Capacidad para crear servidores simples, trabajar con Express, manejar rutas, middlewares y realizar peticiones HTTP, así como conectar con bases de datos y consumir APIs externas.",
    "categoria": "Backend"
  },
  {
    "nombre": "Postman",
    "descripcion":"Nivel básico-intermedio. Capacidad para testear APIs REST, enviar peticiones HTTP (GET, POST, PUT, DELETE), trabajar con parámetros, headers, autenticación, y analizar respuestas para depuración y desarrollo backend.",
    "categoria": "Herramientas"
  },
  {
    "nombre":"MongoDB",
    "descripcion": "Nivel básico-intermedio. Capacidad para diseñar y consultar bases de datos NoSQL, realizar operaciones CRUD, trabajar con mongoose en aplicaciones Node.js y estructurar documentos usando esquemas flexibles.",
    "categoria": "Base de datos"
  },
  {
    "nombre":"Firebase",
    "descripcion": "Nivel básico. Uso de servicios como autenticación, Firestore y almacenamiento desde Firebase Console e integración básica con proyectos web mediante SDK.",
    "categoria": "Base de datos"
  },
  {
    "nombre": "Typescript",
    "descripcion": "Nivel básico. Conocimientos en tipado estático, definición de tipos, interfaces y uso en conjunto con proyectos JavaScript y frameworks como React para mejorar la robustez del código.",
    "categoria": "Lenguajes"
  },
  {
    "nombre": "Kotlin",
    "descripcion": " Nivel básico-intermedio. Experiencia en desarrollo Android con arquitectura MVVM, uso de corrutinas para operaciones asincrónicas, manejo de ViewModel y LiveData, e integración con APIs REST utilizando Retrofit.",
    "categoria": "Lenguajes"
  },
  {
    "nombre": "Ruby",
    "descripcion":"Nivel básico. Conocimientos en sintaxis, estructuras de control, manejo de variables, métodos, arrays y hashes. Capacidad para escribir scripts simples y trabajar con archivos.",
    "categoria": "Lenguajes"
  },
  {
    "nombre": "Git",
    "descripcion": "Nivel básico-intermedio. Capacidad para versionar proyectos, realizar commits, trabajar con ramas, fusionar cambios, resolver conflictos y colaborar mediante plataformas como GitHub.",
    "categoria": "Herramientas"
  },
  {
    "nombre": "MySQL",
    "descripcion": "Nivel básico-intermedio. Capacidad para diseñar y gestionar bases de datos relacionales, realizar consultas SQL básicas, operaciones CRUD, y manejar relaciones entre tablas.",
    "categoria":"Base de datos"
  },
  {
    "nombre":"Bootstrap",
    "descripcion": "Nivel básico-intermedio. Capacidad para diseñar interfaces responsivas utilizando el sistema de grillas, componentes predefinidos, utilidades CSS y personalización básica mediante variables Sass.",
    "categoria": "Frontend"
  }
]
